espressif/esp-idf/components/soc/esp32s3/include/soc/slc_reg.h
#define SLC_INT_ENA_REG          (DR_REG_SLC_BASE + 0xC)
/* SLC_SLC0_HOST_POP_EOF_ERR_INT_ENA : R/W ;bitpos:[27] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_ENA    (BIT(27))
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_ENA_M  (BIT(27))
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_ENA_V  0x1
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_ENA_S  27
/* SLC_SLC0_RX_QUICK_EOF_INT_ENA : R/W ;bitpos:[26] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_QUICK_EOF_INT_ENA    (BIT(26))
#define SLC_SLC0_RX_QUICK_EOF_INT_ENA_M  (BIT(26))
#define SLC_SLC0_RX_QUICK_EOF_INT_ENA_V  0x1
#define SLC_SLC0_RX_QUICK_EOF_INT_ENA_S  26
/* SLC_CMD_DTC_INT_ENA : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: .*/
#define SLC_CMD_DTC_INT_ENA    (BIT(25))
#define SLC_CMD_DTC_INT_ENA_M  (BIT(25))
#define SLC_CMD_DTC_INT_ENA_V  0x1
#define SLC_CMD_DTC_INT_ENA_S  25
/* SLC_SLC0_TX_ERR_EOF_INT_ENA : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_ERR_EOF_INT_ENA    (BIT(24))
#define SLC_SLC0_TX_ERR_EOF_INT_ENA_M  (BIT(24))
#define SLC_SLC0_TX_ERR_EOF_INT_ENA_V  0x1
#define SLC_SLC0_TX_ERR_EOF_INT_ENA_S  24
/* SLC_SLC0_WR_RETRY_DONE_INT_ENA : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_WR_RETRY_DONE_INT_ENA    (BIT(23))
#define SLC_SLC0_WR_RETRY_DONE_INT_ENA_M  (BIT(23))
#define SLC_SLC0_WR_RETRY_DONE_INT_ENA_V  0x1
#define SLC_SLC0_WR_RETRY_DONE_INT_ENA_S  23
/* SLC_SLC0_HOST_RD_ACK_INT_ENA : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_HOST_RD_ACK_INT_ENA    (BIT(22))
#define SLC_SLC0_HOST_RD_ACK_INT_ENA_M  (BIT(22))
#define SLC_SLC0_HOST_RD_ACK_INT_ENA_V  0x1
#define SLC_SLC0_HOST_RD_ACK_INT_ENA_S  22
/* SLC_SLC0_TX_DSCR_EMPTY_INT_ENA : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_DSCR_EMPTY_INT_ENA    (BIT(21))
#define SLC_SLC0_TX_DSCR_EMPTY_INT_ENA_M  (BIT(21))
#define SLC_SLC0_TX_DSCR_EMPTY_INT_ENA_V  0x1
#define SLC_SLC0_TX_DSCR_EMPTY_INT_ENA_S  21
/* SLC_SLC0_RX_DSCR_ERR_INT_ENA : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_DSCR_ERR_INT_ENA    (BIT(20))
#define SLC_SLC0_RX_DSCR_ERR_INT_ENA_M  (BIT(20))
#define SLC_SLC0_RX_DSCR_ERR_INT_ENA_V  0x1
#define SLC_SLC0_RX_DSCR_ERR_INT_ENA_S  20
/* SLC_SLC0_TX_DSCR_ERR_INT_ENA : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_DSCR_ERR_INT_ENA    (BIT(19))
#define SLC_SLC0_TX_DSCR_ERR_INT_ENA_M  (BIT(19))
#define SLC_SLC0_TX_DSCR_ERR_INT_ENA_V  0x1
#define SLC_SLC0_TX_DSCR_ERR_INT_ENA_S  19
/* SLC_SLC0_TOHOST_INT_ENA : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TOHOST_INT_ENA    (BIT(18))
#define SLC_SLC0_TOHOST_INT_ENA_M  (BIT(18))
#define SLC_SLC0_TOHOST_INT_ENA_V  0x1
#define SLC_SLC0_TOHOST_INT_ENA_S  18
/* SLC_SLC0_RX_EOF_INT_ENA : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_EOF_INT_ENA    (BIT(17))
#define SLC_SLC0_RX_EOF_INT_ENA_M  (BIT(17))
#define SLC_SLC0_RX_EOF_INT_ENA_V  0x1
#define SLC_SLC0_RX_EOF_INT_ENA_S  17
/* SLC_SLC0_RX_DONE_INT_ENA : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_DONE_INT_ENA    (BIT(16))
#define SLC_SLC0_RX_DONE_INT_ENA_M  (BIT(16))
#define SLC_SLC0_RX_DONE_INT_ENA_V  0x1
#define SLC_SLC0_RX_DONE_INT_ENA_S  16
/* SLC_SLC0_TX_SUC_EOF_INT_ENA : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_SUC_EOF_INT_ENA    (BIT(15))
#define SLC_SLC0_TX_SUC_EOF_INT_ENA_M  (BIT(15))
#define SLC_SLC0_TX_SUC_EOF_INT_ENA_V  0x1
#define SLC_SLC0_TX_SUC_EOF_INT_ENA_S  15
/* SLC_SLC0_TX_DONE_INT_ENA : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_DONE_INT_ENA    (BIT(14))
#define SLC_SLC0_TX_DONE_INT_ENA_M  (BIT(14))
#define SLC_SLC0_TX_DONE_INT_ENA_V  0x1
#define SLC_SLC0_TX_DONE_INT_ENA_S  14
/* SLC_SLC0_TOKEN1_1TO0_INT_ENA : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TOKEN1_1TO0_INT_ENA    (BIT(13))
#define SLC_SLC0_TOKEN1_1TO0_INT_ENA_M  (BIT(13))
#define SLC_SLC0_TOKEN1_1TO0_INT_ENA_V  0x1
#define SLC_SLC0_TOKEN1_1TO0_INT_ENA_S  13
/* SLC_SLC0_TOKEN0_1TO0_INT_ENA : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TOKEN0_1TO0_INT_ENA    (BIT(12))
#define SLC_SLC0_TOKEN0_1TO0_INT_ENA_M  (BIT(12))
#define SLC_SLC0_TOKEN0_1TO0_INT_ENA_V  0x1
#define SLC_SLC0_TOKEN0_1TO0_INT_ENA_S  12
/* SLC_SLC0_TX_OVF_INT_ENA : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_OVF_INT_ENA    (BIT(11))
#define SLC_SLC0_TX_OVF_INT_ENA_M  (BIT(11))
#define SLC_SLC0_TX_OVF_INT_ENA_V  0x1
#define SLC_SLC0_TX_OVF_INT_ENA_S  11
/* SLC_SLC0_RX_UDF_INT_ENA : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_UDF_INT_ENA    (BIT(10))
#define SLC_SLC0_RX_UDF_INT_ENA_M  (BIT(10))
#define SLC_SLC0_RX_UDF_INT_ENA_V  0x1
#define SLC_SLC0_RX_UDF_INT_ENA_S  10
/* SLC_SLC0_TX_START_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_START_INT_ENA    (BIT(9))
#define SLC_SLC0_TX_START_INT_ENA_M  (BIT(9))
#define SLC_SLC0_TX_START_INT_ENA_V  0x1
#define SLC_SLC0_TX_START_INT_ENA_S  9
/* SLC_SLC0_RX_START_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_START_INT_ENA    (BIT(8))
#define SLC_SLC0_RX_START_INT_ENA_M  (BIT(8))
#define SLC_SLC0_RX_START_INT_ENA_V  0x1
#define SLC_SLC0_RX_START_INT_ENA_S  8
/* SLC_FRHOST_BIT7_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT7_INT_ENA    (BIT(7))
#define SLC_FRHOST_BIT7_INT_ENA_M  (BIT(7))
#define SLC_FRHOST_BIT7_INT_ENA_V  0x1
#define SLC_FRHOST_BIT7_INT_ENA_S  7
/* SLC_FRHOST_BIT6_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT6_INT_ENA    (BIT(6))
#define SLC_FRHOST_BIT6_INT_ENA_M  (BIT(6))
#define SLC_FRHOST_BIT6_INT_ENA_V  0x1
#define SLC_FRHOST_BIT6_INT_ENA_S  6
/* SLC_FRHOST_BIT5_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT5_INT_ENA    (BIT(5))
#define SLC_FRHOST_BIT5_INT_ENA_M  (BIT(5))
#define SLC_FRHOST_BIT5_INT_ENA_V  0x1
#define SLC_FRHOST_BIT5_INT_ENA_S  5
/* SLC_FRHOST_BIT4_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT4_INT_ENA    (BIT(4))
#define SLC_FRHOST_BIT4_INT_ENA_M  (BIT(4))
#define SLC_FRHOST_BIT4_INT_ENA_V  0x1
#define SLC_FRHOST_BIT4_INT_ENA_S  4
/* SLC_FRHOST_BIT3_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT3_INT_ENA    (BIT(3))
#define SLC_FRHOST_BIT3_INT_ENA_M  (BIT(3))
#define SLC_FRHOST_BIT3_INT_ENA_V  0x1
#define SLC_FRHOST_BIT3_INT_ENA_S  3
/* SLC_FRHOST_BIT2_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT2_INT_ENA    (BIT(2))
#define SLC_FRHOST_BIT2_INT_ENA_M  (BIT(2))
#define SLC_FRHOST_BIT2_INT_ENA_V  0x1
#define SLC_FRHOST_BIT2_INT_ENA_S  2
/* SLC_FRHOST_BIT1_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT1_INT_ENA    (BIT(1))
#define SLC_FRHOST_BIT1_INT_ENA_M  (BIT(1))
#define SLC_FRHOST_BIT1_INT_ENA_V  0x1
#define SLC_FRHOST_BIT1_INT_ENA_S  1
/* SLC_FRHOST_BIT0_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT0_INT_ENA    (BIT(0))
#define SLC_FRHOST_BIT0_INT_ENA_M  (BIT(0))
#define SLC_FRHOST_BIT0_INT_ENA_V  0x1
#define SLC_FRHOST_BIT0_INT_ENA_S  0

#define SLC_INT_CLR_REG          (DR_REG_SLC_BASE + 0x10)
/* SLC_SLC0_HOST_POP_EOF_ERR_INT_CLR : WO ;bitpos:[27] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_CLR    (BIT(27))
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_CLR_M  (BIT(27))
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_CLR_V  0x1
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_CLR_S  27
/* SLC_SLC0_RX_QUICK_EOF_INT_CLR : WO ;bitpos:[26] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_QUICK_EOF_INT_CLR    (BIT(26))
#define SLC_SLC0_RX_QUICK_EOF_INT_CLR_M  (BIT(26))
#define SLC_SLC0_RX_QUICK_EOF_INT_CLR_V  0x1
#define SLC_SLC0_RX_QUICK_EOF_INT_CLR_S  26
/* SLC_CMD_DTC_INT_CLR : WO ;bitpos:[25] ;default: 1'b0 ; */
/*description: .*/
#define SLC_CMD_DTC_INT_CLR    (BIT(25))
#define SLC_CMD_DTC_INT_CLR_M  (BIT(25))
#define SLC_CMD_DTC_INT_CLR_V  0x1
#define SLC_CMD_DTC_INT_CLR_S  25
/* SLC_SLC0_TX_ERR_EOF_INT_CLR : WO ;bitpos:[24] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_ERR_EOF_INT_CLR    (BIT(24))
#define SLC_SLC0_TX_ERR_EOF_INT_CLR_M  (BIT(24))
#define SLC_SLC0_TX_ERR_EOF_INT_CLR_V  0x1
#define SLC_SLC0_TX_ERR_EOF_INT_CLR_S  24
/* SLC_SLC0_WR_RETRY_DONE_INT_CLR : WO ;bitpos:[23] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_WR_RETRY_DONE_INT_CLR    (BIT(23))
#define SLC_SLC0_WR_RETRY_DONE_INT_CLR_M  (BIT(23))
#define SLC_SLC0_WR_RETRY_DONE_INT_CLR_V  0x1
#define SLC_SLC0_WR_RETRY_DONE_INT_CLR_S  23
/* SLC_SLC0_HOST_RD_ACK_INT_CLR : WO ;bitpos:[22] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_HOST_RD_ACK_INT_CLR    (BIT(22))
#define SLC_SLC0_HOST_RD_ACK_INT_CLR_M  (BIT(22))
#define SLC_SLC0_HOST_RD_ACK_INT_CLR_V  0x1
#define SLC_SLC0_HOST_RD_ACK_INT_CLR_S  22
/* SLC_SLC0_TX_DSCR_EMPTY_INT_CLR : WO ;bitpos:[21] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_DSCR_EMPTY_INT_CLR    (BIT(21))
#define SLC_SLC0_TX_DSCR_EMPTY_INT_CLR_M  (BIT(21))
#define SLC_SLC0_TX_DSCR_EMPTY_INT_CLR_V  0x1
#define SLC_SLC0_TX_DSCR_EMPTY_INT_CLR_S  21
/* SLC_SLC0_RX_DSCR_ERR_INT_CLR : WO ;bitpos:[20] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_DSCR_ERR_INT_CLR    (BIT(20))
#define SLC_SLC0_RX_DSCR_ERR_INT_CLR_M  (BIT(20))
#define SLC_SLC0_RX_DSCR_ERR_INT_CLR_V  0x1
#define SLC_SLC0_RX_DSCR_ERR_INT_CLR_S  20
/* SLC_SLC0_TX_DSCR_ERR_INT_CLR : WO ;bitpos:[19] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_DSCR_ERR_INT_CLR    (BIT(19))
#define SLC_SLC0_TX_DSCR_ERR_INT_CLR_M  (BIT(19))
#define SLC_SLC0_TX_DSCR_ERR_INT_CLR_V  0x1
#define SLC_SLC0_TX_DSCR_ERR_INT_CLR_S  19
/* SLC_SLC0_TOHOST_INT_CLR : WO ;bitpos:[18] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TOHOST_INT_CLR    (BIT(18))
#define SLC_SLC0_TOHOST_INT_CLR_M  (BIT(18))
#define SLC_SLC0_TOHOST_INT_CLR_V  0x1
#define SLC_SLC0_TOHOST_INT_CLR_S  18
/* SLC_SLC0_RX_EOF_INT_CLR : WO ;bitpos:[17] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_EOF_INT_CLR    (BIT(17))
#define SLC_SLC0_RX_EOF_INT_CLR_M  (BIT(17))
#define SLC_SLC0_RX_EOF_INT_CLR_V  0x1
#define SLC_SLC0_RX_EOF_INT_CLR_S  17
/* SLC_SLC0_RX_DONE_INT_CLR : WO ;bitpos:[16] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_DONE_INT_CLR    (BIT(16))
#define SLC_SLC0_RX_DONE_INT_CLR_M  (BIT(16))
#define SLC_SLC0_RX_DONE_INT_CLR_V  0x1
#define SLC_SLC0_RX_DONE_INT_CLR_S  16
/* SLC_SLC0_TX_SUC_EOF_INT_CLR : WO ;bitpos:[15] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_SUC_EOF_INT_CLR    (BIT(15))
#define SLC_SLC0_TX_SUC_EOF_INT_CLR_M  (BIT(15))
#define SLC_SLC0_TX_SUC_EOF_INT_CLR_V  0x1
#define SLC_SLC0_TX_SUC_EOF_INT_CLR_S  15
/* SLC_SLC0_TX_DONE_INT_CLR : WO ;bitpos:[14] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_DONE_INT_CLR    (BIT(14))
#define SLC_SLC0_TX_DONE_INT_CLR_M  (BIT(14))
#define SLC_SLC0_TX_DONE_INT_CLR_V  0x1
#define SLC_SLC0_TX_DONE_INT_CLR_S  14
/* SLC_SLC0_TOKEN1_1TO0_INT_CLR : WO ;bitpos:[13] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TOKEN1_1TO0_INT_CLR    (BIT(13))
#define SLC_SLC0_TOKEN1_1TO0_INT_CLR_M  (BIT(13))
#define SLC_SLC0_TOKEN1_1TO0_INT_CLR_V  0x1
#define SLC_SLC0_TOKEN1_1TO0_INT_CLR_S  13
/* SLC_SLC0_TOKEN0_1TO0_INT_CLR : WO ;bitpos:[12] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TOKEN0_1TO0_INT_CLR    (BIT(12))
#define SLC_SLC0_TOKEN0_1TO0_INT_CLR_M  (BIT(12))
#define SLC_SLC0_TOKEN0_1TO0_INT_CLR_V  0x1
#define SLC_SLC0_TOKEN0_1TO0_INT_CLR_S  12
/* SLC_SLC0_TX_OVF_INT_CLR : WO ;bitpos:[11] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_OVF_INT_CLR    (BIT(11))
#define SLC_SLC0_TX_OVF_INT_CLR_M  (BIT(11))
#define SLC_SLC0_TX_OVF_INT_CLR_V  0x1
#define SLC_SLC0_TX_OVF_INT_CLR_S  11
/* SLC_SLC0_RX_UDF_INT_CLR : WO ;bitpos:[10] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_UDF_INT_CLR    (BIT(10))
#define SLC_SLC0_RX_UDF_INT_CLR_M  (BIT(10))
#define SLC_SLC0_RX_UDF_INT_CLR_V  0x1
#define SLC_SLC0_RX_UDF_INT_CLR_S  10
/* SLC_SLC0_TX_START_INT_CLR : WO ;bitpos:[9] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_START_INT_CLR    (BIT(9))
#define SLC_SLC0_TX_START_INT_CLR_M  (BIT(9))
#define SLC_SLC0_TX_START_INT_CLR_V  0x1
#define SLC_SLC0_TX_START_INT_CLR_S  9
/* SLC_SLC0_RX_START_INT_CLR : WO ;bitpos:[8] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_START_INT_CLR    (BIT(8))
#define SLC_SLC0_RX_START_INT_CLR_M  (BIT(8))
#define SLC_SLC0_RX_START_INT_CLR_V  0x1
#define SLC_SLC0_RX_START_INT_CLR_S  8
/* SLC_FRHOST_BIT7_INT_CLR : WO ;bitpos:[7] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT7_INT_CLR    (BIT(7))
#define SLC_FRHOST_BIT7_INT_CLR_M  (BIT(7))
#define SLC_FRHOST_BIT7_INT_CLR_V  0x1
#define SLC_FRHOST_BIT7_INT_CLR_S  7
/* SLC_FRHOST_BIT6_INT_CLR : WO ;bitpos:[6] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT6_INT_CLR    (BIT(6))
#define SLC_FRHOST_BIT6_INT_CLR_M  (BIT(6))
#define SLC_FRHOST_BIT6_INT_CLR_V  0x1
#define SLC_FRHOST_BIT6_INT_CLR_S  6
/* SLC_FRHOST_BIT5_INT_CLR : WO ;bitpos:[5] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT5_INT_CLR    (BIT(5))
#define SLC_FRHOST_BIT5_INT_CLR_M  (BIT(5))
#define SLC_FRHOST_BIT5_INT_CLR_V  0x1
#define SLC_FRHOST_BIT5_INT_CLR_S  5
/* SLC_FRHOST_BIT4_INT_CLR : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT4_INT_CLR    (BIT(4))
#define SLC_FRHOST_BIT4_INT_CLR_M  (BIT(4))
#define SLC_FRHOST_BIT4_INT_CLR_V  0x1
#define SLC_FRHOST_BIT4_INT_CLR_S  4
/* SLC_FRHOST_BIT3_INT_CLR : WO ;bitpos:[3] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT3_INT_CLR    (BIT(3))
#define SLC_FRHOST_BIT3_INT_CLR_M  (BIT(3))
#define SLC_FRHOST_BIT3_INT_CLR_V  0x1
#define SLC_FRHOST_BIT3_INT_CLR_S  3
/* SLC_FRHOST_BIT2_INT_CLR : WO ;bitpos:[2] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT2_INT_CLR    (BIT(2))
#define SLC_FRHOST_BIT2_INT_CLR_M  (BIT(2))
#define SLC_FRHOST_BIT2_INT_CLR_V  0x1
#define SLC_FRHOST_BIT2_INT_CLR_S  2
/* SLC_FRHOST_BIT1_INT_CLR : WO ;bitpos:[1] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT1_INT_CLR    (BIT(1))
#define SLC_FRHOST_BIT1_INT_CLR_M  (BIT(1))
#define SLC_FRHOST_BIT1_INT_CLR_V  0x1
#define SLC_FRHOST_BIT1_INT_CLR_S  1
/* SLC_FRHOST_BIT0_INT_CLR : WO ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT0_INT_CLR    (BIT(0))
#define SLC_FRHOST_BIT0_INT_CLR_M  (BIT(0))
#define SLC_FRHOST_BIT0_INT_CLR_V  0x1
#define SLC_FRHOST_BIT0_INT_CLR_S  0

#define SLC_SLCRX_STATUS_REG          (DR_REG_SLC_BASE + 0x24)
/* SLC_SLC0_RX_BUF_LEN : RO ;bitpos:[13:2] ;default: 12'h0 ; */
/*description: .*/
#define SLC_SLC0_RX_BUF_LEN    0x00000FFF
#define SLC_SLC0_RX_BUF_LEN_M  ((SLC_SLC0_RX_BUF_LEN_V)<<(SLC_SLC0_RX_BUF_LEN_S))
#define SLC_SLC0_RX_BUF_LEN_V  0xFFF
#define SLC_SLC0_RX_BUF_LEN_S  2
/* SLC_SLC0_RX_EMPTY : RO ;bitpos:[1] ;default: 1'b1 ; */
/*description: .*/
#define SLC_SLC0_RX_EMPTY    (BIT(1))
#define SLC_SLC0_RX_EMPTY_M  (BIT(1))
#define SLC_SLC0_RX_EMPTY_V  0x1
#define SLC_SLC0_RX_EMPTY_S  1
/* SLC_SLC0_RX_FULL : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_FULL    (BIT(0))
#define SLC_SLC0_RX_FULL_M  (BIT(0))
#define SLC_SLC0_RX_FULL_V  0x1
#define SLC_SLC0_RX_FULL_S  0

#define SLC_RXFIFO_PUSH_REG          (DR_REG_SLC_BASE + 0x28)
/* SLC_SLC0_RXFIFO_PUSH : R/W ;bitpos:[16] ;default: 1'h0 ; */
/*description: .*/
#define SLC_SLC0_RXFIFO_PUSH    (BIT(16))
#define SLC_SLC0_RXFIFO_PUSH_M  (BIT(16))
#define SLC_SLC0_RXFIFO_PUSH_V  0x1
#define SLC_SLC0_RXFIFO_PUSH_S  16
/* SLC_SLC0_RXFIFO_WDATA : R/W ;bitpos:[8:0] ;default: 9'h0 ; */
/*description: .*/
#define SLC_SLC0_RXFIFO_WDATA    0x000001FF
#define SLC_SLC0_RXFIFO_WDATA_M  ((SLC_SLC0_RXFIFO_WDATA_V)<<(SLC_SLC0_RXFIFO_WDATA_S))
#define SLC_SLC0_RXFIFO_WDATA_V  0x1FF
#define SLC_SLC0_RXFIFO_WDATA_S  0

#define SLC_SLCTX_STATUS_REG          (DR_REG_SLC_BASE + 0x30)
/* SLC_SLC0_TX_EMPTY : RO ;bitpos:[1] ;default: 1'b1 ; */
/*description: .*/
#define SLC_SLC0_TX_EMPTY    (BIT(1))
#define SLC_SLC0_TX_EMPTY_M  (BIT(1))
#define SLC_SLC0_TX_EMPTY_V  0x1
#define SLC_SLC0_TX_EMPTY_S  1
/* SLC_SLC0_TX_FULL : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_FULL    (BIT(0))
#define SLC_SLC0_TX_FULL_M  (BIT(0))
#define SLC_SLC0_TX_FULL_V  0x1
#define SLC_SLC0_TX_FULL_S  0

#define SLC_TXFIFO_POP_REG          (DR_REG_SLC_BASE + 0x34)
/* SLC_SLC0_TXFIFO_POP : R/W ;bitpos:[16] ;default: 1'h0 ; */
/*description: .*/
#define SLC_SLC0_TXFIFO_POP    (BIT(16))
#define SLC_SLC0_TXFIFO_POP_M  (BIT(16))
#define SLC_SLC0_TXFIFO_POP_V  0x1
#define SLC_SLC0_TXFIFO_POP_S  16
/* SLC_SLC0_TXFIFO_RDATA : RO ;bitpos:[10:0] ;default: 11'h0 ; */
/*description: .*/
#define SLC_SLC0_TXFIFO_RDATA    0x000007FF
#define SLC_SLC0_TXFIFO_RDATA_M  ((SLC_SLC0_TXFIFO_RDATA_V)<<(SLC_SLC0_TXFIFO_RDATA_S))
#define SLC_SLC0_TXFIFO_RDATA_V  0x7FF
#define SLC_SLC0_TXFIFO_RDATA_S  0

