espressif/esp-idf/components/soc/esp32s3/include/soc/slc_reg.h
#define SLC_RX_LINK_REG          (DR_REG_SLC_BASE + 0x3C)
/* SLC_SLC0_RXLINK_PARK : RO ;bitpos:[31] ;default: 1'h0 ; */
/*description: .*/
#define SLC_SLC0_RXLINK_PARK    (BIT(31))
#define SLC_SLC0_RXLINK_PARK_M  (BIT(31))
#define SLC_SLC0_RXLINK_PARK_V  0x1
#define SLC_SLC0_RXLINK_PARK_S  31
/* SLC_SLC0_RXLINK_RESTART : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RXLINK_RESTART    (BIT(30))
#define SLC_SLC0_RXLINK_RESTART_M  (BIT(30))
#define SLC_SLC0_RXLINK_RESTART_V  0x1
#define SLC_SLC0_RXLINK_RESTART_S  30
/* SLC_SLC0_RXLINK_START : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RXLINK_START    (BIT(29))
#define SLC_SLC0_RXLINK_START_M  (BIT(29))
#define SLC_SLC0_RXLINK_START_V  0x1
#define SLC_SLC0_RXLINK_START_S  29
/* SLC_SLC0_RXLINK_STOP : R/W ;bitpos:[28] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RXLINK_STOP    (BIT(28))
#define SLC_SLC0_RXLINK_STOP_M  (BIT(28))
#define SLC_SLC0_RXLINK_STOP_V  0x1
#define SLC_SLC0_RXLINK_STOP_S  28
/* SLC_SLC0_RXLINK_ADDR : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: .*/
#define SLC_SLC0_RXLINK_ADDR    0x000FFFFF
#define SLC_SLC0_RXLINK_ADDR_M  ((SLC_SLC0_RXLINK_ADDR_V)<<(SLC_SLC0_RXLINK_ADDR_S))
#define SLC_SLC0_RXLINK_ADDR_V  0xFFFFF
#define SLC_SLC0_RXLINK_ADDR_S  0

#define SLC_TX_LINK_REG          (DR_REG_SLC_BASE + 0x40)
/* SLC_SLC0_TXLINK_PARK : RO ;bitpos:[31] ;default: 1'h0 ; */
/*description: .*/
#define SLC_SLC0_TXLINK_PARK    (BIT(31))
#define SLC_SLC0_TXLINK_PARK_M  (BIT(31))
#define SLC_SLC0_TXLINK_PARK_V  0x1
#define SLC_SLC0_TXLINK_PARK_S  31
/* SLC_SLC0_TXLINK_RESTART : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TXLINK_RESTART    (BIT(30))
#define SLC_SLC0_TXLINK_RESTART_M  (BIT(30))
#define SLC_SLC0_TXLINK_RESTART_V  0x1
#define SLC_SLC0_TXLINK_RESTART_S  30
/* SLC_SLC0_TXLINK_START : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TXLINK_START    (BIT(29))
#define SLC_SLC0_TXLINK_START_M  (BIT(29))
#define SLC_SLC0_TXLINK_START_V  0x1
#define SLC_SLC0_TXLINK_START_S  29
/* SLC_SLC0_TXLINK_STOP : R/W ;bitpos:[28] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TXLINK_STOP    (BIT(28))
#define SLC_SLC0_TXLINK_STOP_M  (BIT(28))
#define SLC_SLC0_TXLINK_STOP_V  0x1
#define SLC_SLC0_TXLINK_STOP_S  28
/* SLC_SLC0_TXLINK_ADDR : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: .*/
#define SLC_SLC0_TXLINK_ADDR    0x000FFFFF
#define SLC_SLC0_TXLINK_ADDR_M  ((SLC_SLC0_TXLINK_ADDR_V)<<(SLC_SLC0_TXLINK_ADDR_S))
#define SLC_SLC0_TXLINK_ADDR_V  0xFFFFF
#define SLC_SLC0_TXLINK_ADDR_S  0

#define SLC_SLCINTVEC_TOHOST_REG          (DR_REG_SLC_BASE + 0x4C)
/* SLC_SLC0_TOHOST_INTVEC : WO ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: .*/
#define SLC_SLC0_TOHOST_INTVEC    0x000000FF
#define SLC_SLC0_TOHOST_INTVEC_M  ((SLC_SLC0_TOHOST_INTVEC_V)<<(SLC_SLC0_TOHOST_INTVEC_S))
#define SLC_SLC0_TOHOST_INTVEC_V  0xFF
#define SLC_SLC0_TOHOST_INTVEC_S  0

#define SLC_TOKEN0_REG          (DR_REG_SLC_BASE + 0x50)
/* SLC_SLC0_TOKEN0 : RO ;bitpos:[27:16] ;default: 12'h0 ; */
/*description: .*/
#define SLC_SLC0_TOKEN0    0x00000FFF
#define SLC_SLC0_TOKEN0_M  ((SLC_SLC0_TOKEN0_V)<<(SLC_SLC0_TOKEN0_S))
#define SLC_SLC0_TOKEN0_V  0xFFF
#define SLC_SLC0_TOKEN0_S  16
/* SLC_SLC0_TOKEN0_INC_MORE : WO ;bitpos:[14] ;default: 1'h0 ; */
/*description: .*/
#define SLC_SLC0_TOKEN0_INC_MORE    (BIT(14))
#define SLC_SLC0_TOKEN0_INC_MORE_M  (BIT(14))
#define SLC_SLC0_TOKEN0_INC_MORE_V  0x1
#define SLC_SLC0_TOKEN0_INC_MORE_S  14
/* SLC_SLC0_TOKEN0_INC : WO ;bitpos:[13] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TOKEN0_INC    (BIT(13))
#define SLC_SLC0_TOKEN0_INC_M  (BIT(13))
#define SLC_SLC0_TOKEN0_INC_V  0x1
#define SLC_SLC0_TOKEN0_INC_S  13
/* SLC_SLC0_TOKEN0_WR : WO ;bitpos:[12] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TOKEN0_WR    (BIT(12))
#define SLC_SLC0_TOKEN0_WR_M  (BIT(12))
#define SLC_SLC0_TOKEN0_WR_V  0x1
#define SLC_SLC0_TOKEN0_WR_S  12
/* SLC_SLC0_TOKEN0_WDATA : WO ;bitpos:[11:0] ;default: 12'h0 ; */
/*description: .*/
#define SLC_SLC0_TOKEN0_WDATA    0x00000FFF
#define SLC_SLC0_TOKEN0_WDATA_M  ((SLC_SLC0_TOKEN0_WDATA_V)<<(SLC_SLC0_TOKEN0_WDATA_S))
#define SLC_SLC0_TOKEN0_WDATA_V  0xFFF
#define SLC_SLC0_TOKEN0_WDATA_S  0

#define SLC_TOKEN1_REG          (DR_REG_SLC_BASE + 0x54)
/* SLC_SLC0_TOKEN1 : RO ;bitpos:[27:16] ;default: 12'h0 ; */
/*description: .*/
#define SLC_SLC0_TOKEN1    0x00000FFF
#define SLC_SLC0_TOKEN1_M  ((SLC_SLC0_TOKEN1_V)<<(SLC_SLC0_TOKEN1_S))
#define SLC_SLC0_TOKEN1_V  0xFFF
#define SLC_SLC0_TOKEN1_S  16
/* SLC_SLC0_TOKEN1_INC_MORE : WO ;bitpos:[14] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TOKEN1_INC_MORE    (BIT(14))
#define SLC_SLC0_TOKEN1_INC_MORE_M  (BIT(14))
#define SLC_SLC0_TOKEN1_INC_MORE_V  0x1
#define SLC_SLC0_TOKEN1_INC_MORE_S  14
/* SLC_SLC0_TOKEN1_INC : WO ;bitpos:[13] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TOKEN1_INC    (BIT(13))
#define SLC_SLC0_TOKEN1_INC_M  (BIT(13))
#define SLC_SLC0_TOKEN1_INC_V  0x1
#define SLC_SLC0_TOKEN1_INC_S  13
/* SLC_SLC0_TOKEN1_WR : WO ;bitpos:[12] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TOKEN1_WR    (BIT(12))
#define SLC_SLC0_TOKEN1_WR_M  (BIT(12))
#define SLC_SLC0_TOKEN1_WR_V  0x1
#define SLC_SLC0_TOKEN1_WR_S  12
/* SLC_SLC0_TOKEN1_WDATA : WO ;bitpos:[11:0] ;default: 12'h0 ; */
/*description: .*/
#define SLC_SLC0_TOKEN1_WDATA    0x00000FFF
#define SLC_SLC0_TOKEN1_WDATA_M  ((SLC_SLC0_TOKEN1_WDATA_V)<<(SLC_SLC0_TOKEN1_WDATA_S))
#define SLC_SLC0_TOKEN1_WDATA_V  0xFFF
#define SLC_SLC0_TOKEN1_WDATA_S  0

#define SLC_SLCCONF1_REG          (DR_REG_SLC_BASE + 0x60)
/* SLC_CLK_EN : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: .*/
#define SLC_CLK_EN    (BIT(22))
#define SLC_CLK_EN_M  (BIT(22))
#define SLC_CLK_EN_V  0x1
#define SLC_CLK_EN_S  22
/* SLC_HOST_INT_LEVEL_SEL : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: .*/
#define SLC_HOST_INT_LEVEL_SEL    (BIT(19))
#define SLC_HOST_INT_LEVEL_SEL_M  (BIT(19))
#define SLC_HOST_INT_LEVEL_SEL_V  0x1
#define SLC_HOST_INT_LEVEL_SEL_S  19
/* SLC_SLC0_RX_STITCH_EN : R/W ;bitpos:[6] ;default: 1'b1 ; */
/*description: .*/
#define SLC_SLC0_RX_STITCH_EN    (BIT(6))
#define SLC_SLC0_RX_STITCH_EN_M  (BIT(6))
#define SLC_SLC0_RX_STITCH_EN_V  0x1
#define SLC_SLC0_RX_STITCH_EN_S  6
/* SLC_SLC0_TX_STITCH_EN : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: .*/
#define SLC_SLC0_TX_STITCH_EN    (BIT(5))
#define SLC_SLC0_TX_STITCH_EN_M  (BIT(5))
#define SLC_SLC0_TX_STITCH_EN_V  0x1
#define SLC_SLC0_TX_STITCH_EN_S  5
/* SLC_SLC0_LEN_AUTO_CLR : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: .*/
#define SLC_SLC0_LEN_AUTO_CLR    (BIT(4))
#define SLC_SLC0_LEN_AUTO_CLR_M  (BIT(4))
#define SLC_SLC0_LEN_AUTO_CLR_V  0x1
#define SLC_SLC0_LEN_AUTO_CLR_S  4
/* SLC_CMD_HOLD_EN : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: .*/
#define SLC_CMD_HOLD_EN    (BIT(3))
#define SLC_CMD_HOLD_EN_M  (BIT(3))
#define SLC_CMD_HOLD_EN_V  0x1
#define SLC_CMD_HOLD_EN_S  3
/* SLC_SLC0_RX_CHECK_SUM_EN : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_CHECK_SUM_EN    (BIT(2))
#define SLC_SLC0_RX_CHECK_SUM_EN_M  (BIT(2))
#define SLC_SLC0_RX_CHECK_SUM_EN_V  0x1
#define SLC_SLC0_RX_CHECK_SUM_EN_S  2
/* SLC_SLC0_TX_CHECK_SUM_EN : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_CHECK_SUM_EN    (BIT(1))
#define SLC_SLC0_TX_CHECK_SUM_EN_M  (BIT(1))
#define SLC_SLC0_TX_CHECK_SUM_EN_V  0x1
#define SLC_SLC0_TX_CHECK_SUM_EN_S  1
/* SLC_SLC0_CHECK_OWNER : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_CHECK_OWNER    (BIT(0))
#define SLC_SLC0_CHECK_OWNER_M  (BIT(0))
#define SLC_SLC0_CHECK_OWNER_V  0x1
#define SLC_SLC0_CHECK_OWNER_S  0

#define SLC_STATE0_REG          (DR_REG_SLC_BASE + 0x64)
/* SLC_SLC0_STATE0 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define SLC_SLC0_STATE0    0xFFFFFFFF
#define SLC_SLC0_STATE0_M  ((SLC_SLC0_STATE0_V)<<(SLC_SLC0_STATE0_S))
#define SLC_SLC0_STATE0_V  0xFFFFFFFF
#define SLC_SLC0_STATE0_S  0

#define SLC_STATE1_REG          (DR_REG_SLC_BASE + 0x68)
/* SLC_SLC0_STATE1 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define SLC_SLC0_STATE1    0xFFFFFFFF
#define SLC_SLC0_STATE1_M  ((SLC_SLC0_STATE1_V)<<(SLC_SLC0_STATE1_S))
#define SLC_SLC0_STATE1_V  0xFFFFFFFF
#define SLC_SLC0_STATE1_S  0

#define SLC_SLCBRIDGE_CONF_REG          (DR_REG_SLC_BASE + 0x74)
/* SLC_TX_PUSH_IDLE_NUM : R/W ;bitpos:[31:16] ;default: 16'ha ; */
/*description: .*/
#define SLC_TX_PUSH_IDLE_NUM    0x0000FFFF
#define SLC_TX_PUSH_IDLE_NUM_M  ((SLC_TX_PUSH_IDLE_NUM_V)<<(SLC_TX_PUSH_IDLE_NUM_S))
#define SLC_TX_PUSH_IDLE_NUM_V  0xFFFF
#define SLC_TX_PUSH_IDLE_NUM_S  16
/* SLC_HDA_MAP_128K : R/W ;bitpos:[13] ;default: 1'h1 ; */
/*description: .*/
#define SLC_HDA_MAP_128K    (BIT(13))
#define SLC_HDA_MAP_128K_M  (BIT(13))
#define SLC_HDA_MAP_128K_V  0x1
#define SLC_HDA_MAP_128K_S  13
/* SLC_SLC0_TX_DUMMY_MODE : R/W ;bitpos:[12] ;default: 1'h1 ; */
/*description: .*/
#define SLC_SLC0_TX_DUMMY_MODE    (BIT(12))
#define SLC_SLC0_TX_DUMMY_MODE_M  (BIT(12))
#define SLC_SLC0_TX_DUMMY_MODE_V  0x1
#define SLC_SLC0_TX_DUMMY_MODE_S  12
/* SLC_FIFO_MAP_ENA : R/W ;bitpos:[11:8] ;default: 4'h7 ; */
/*description: .*/
#define SLC_FIFO_MAP_ENA    0x0000000F
#define SLC_FIFO_MAP_ENA_M  ((SLC_FIFO_MAP_ENA_V)<<(SLC_FIFO_MAP_ENA_S))
#define SLC_FIFO_MAP_ENA_V  0xF
#define SLC_FIFO_MAP_ENA_S  8
/* SLC_TXEOF_ENA : R/W ;bitpos:[5:0] ;default: 6'h20 ; */
/*description: .*/
#define SLC_TXEOF_ENA    0x0000003F
#define SLC_TXEOF_ENA_M  ((SLC_TXEOF_ENA_V)<<(SLC_TXEOF_ENA_S))
#define SLC_TXEOF_ENA_V  0x3F
#define SLC_TXEOF_ENA_S  0

#define SLC_TO_EOF_DES_ADDR_REG          (DR_REG_SLC_BASE + 0x78)
/* SLC_SLC0_TO_EOF_DES_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define SLC_SLC0_TO_EOF_DES_ADDR    0xFFFFFFFF
#define SLC_SLC0_TO_EOF_DES_ADDR_M  ((SLC_SLC0_TO_EOF_DES_ADDR_V)<<(SLC_SLC0_TO_EOF_DES_ADDR_S))
#define SLC_SLC0_TO_EOF_DES_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_TO_EOF_DES_ADDR_S  0

#define SLC_TX_EOF_DES_ADDR_REG          (DR_REG_SLC_BASE + 0x7C)
/* SLC_SLC0_TX_SUC_EOF_DES_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define SLC_SLC0_TX_SUC_EOF_DES_ADDR    0xFFFFFFFF
#define SLC_SLC0_TX_SUC_EOF_DES_ADDR_M  ((SLC_SLC0_TX_SUC_EOF_DES_ADDR_V)<<(SLC_SLC0_TX_SUC_EOF_DES_ADDR_S))
#define SLC_SLC0_TX_SUC_EOF_DES_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_TX_SUC_EOF_DES_ADDR_S  0

#define SLC_TO_EOF_BFR_DES_ADDR_REG          (DR_REG_SLC_BASE + 0x80)
/* SLC_SLC0_TO_EOF_BFR_DES_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define SLC_SLC0_TO_EOF_BFR_DES_ADDR    0xFFFFFFFF
#define SLC_SLC0_TO_EOF_BFR_DES_ADDR_M  ((SLC_SLC0_TO_EOF_BFR_DES_ADDR_V)<<(SLC_SLC0_TO_EOF_BFR_DES_ADDR_S))
#define SLC_SLC0_TO_EOF_BFR_DES_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_TO_EOF_BFR_DES_ADDR_S  0

