espressif/esp-idf/components/soc/esp32s3/include/soc/slc_reg.h
#define SLC_AHB_TEST_REG          (DR_REG_SLC_BASE + 0x90)
/* SLC_AHB_TESTADDR : R/W ;bitpos:[5:4] ;default: 2'b0 ; */
/*description: .*/
#define SLC_AHB_TESTADDR    0x00000003
#define SLC_AHB_TESTADDR_M  ((SLC_AHB_TESTADDR_V)<<(SLC_AHB_TESTADDR_S))
#define SLC_AHB_TESTADDR_V  0x3
#define SLC_AHB_TESTADDR_S  4
/* SLC_AHB_TESTMODE : R/W ;bitpos:[2:0] ;default: 3'b0 ; */
/*description: .*/
#define SLC_AHB_TESTMODE    0x00000007
#define SLC_AHB_TESTMODE_M  ((SLC_AHB_TESTMODE_V)<<(SLC_AHB_TESTMODE_S))
#define SLC_AHB_TESTMODE_V  0x7
#define SLC_AHB_TESTMODE_S  0

#define SLC_SDIO_ST_REG          (DR_REG_SLC_BASE + 0x94)
/* SLC_FUNC1_ACC_STATE : RO ;bitpos:[20:16] ;default: 5'b0 ; */
/*description: .*/
#define SLC_FUNC1_ACC_STATE    0x0000001F
#define SLC_FUNC1_ACC_STATE_M  ((SLC_FUNC1_ACC_STATE_V)<<(SLC_FUNC1_ACC_STATE_S))
#define SLC_FUNC1_ACC_STATE_V  0x1F
#define SLC_FUNC1_ACC_STATE_S  16
/* SLC_BUS_ST : RO ;bitpos:[14:12] ;default: 3'b0 ; */
/*description: .*/
#define SLC_BUS_ST    0x00000007
#define SLC_BUS_ST_M  ((SLC_BUS_ST_V)<<(SLC_BUS_ST_S))
#define SLC_BUS_ST_V  0x7
#define SLC_BUS_ST_S  12
/* SLC_SDIO_WAKEUP : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SDIO_WAKEUP    (BIT(8))
#define SLC_SDIO_WAKEUP_M  (BIT(8))
#define SLC_SDIO_WAKEUP_V  0x1
#define SLC_SDIO_WAKEUP_S  8
/* SLC_FUNC_ST : RO ;bitpos:[7:4] ;default: 4'b0 ; */
/*description: .*/
#define SLC_FUNC_ST    0x0000000F
#define SLC_FUNC_ST_M  ((SLC_FUNC_ST_V)<<(SLC_FUNC_ST_S))
#define SLC_FUNC_ST_V  0xF
#define SLC_FUNC_ST_S  4
/* SLC_CMD_ST : RO ;bitpos:[2:0] ;default: 3'b0 ; */
/*description: .*/
#define SLC_CMD_ST    0x00000007
#define SLC_CMD_ST_M  ((SLC_CMD_ST_V)<<(SLC_CMD_ST_S))
#define SLC_CMD_ST_V  0x7
#define SLC_CMD_ST_S  0

#define SLC_RX_DSCR_CONF_REG          (DR_REG_SLC_BASE + 0x98)
/* SLC_SLC0_RD_RETRY_THRESHOLD : R/W ;bitpos:[15:5] ;default: 11'h80 ; */
/*description: .*/
#define SLC_SLC0_RD_RETRY_THRESHOLD    0x000007FF
#define SLC_SLC0_RD_RETRY_THRESHOLD_M  ((SLC_SLC0_RD_RETRY_THRESHOLD_V)<<(SLC_SLC0_RD_RETRY_THRESHOLD_S))
#define SLC_SLC0_RD_RETRY_THRESHOLD_V  0x7FF
#define SLC_SLC0_RD_RETRY_THRESHOLD_S  5
/* SLC_SLC0_RX_FILL_EN : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: .*/
#define SLC_SLC0_RX_FILL_EN    (BIT(4))
#define SLC_SLC0_RX_FILL_EN_M  (BIT(4))
#define SLC_SLC0_RX_FILL_EN_V  0x1
#define SLC_SLC0_RX_FILL_EN_S  4
/* SLC_SLC0_RX_EOF_MODE : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: .*/
#define SLC_SLC0_RX_EOF_MODE    (BIT(3))
#define SLC_SLC0_RX_EOF_MODE_M  (BIT(3))
#define SLC_SLC0_RX_EOF_MODE_V  0x1
#define SLC_SLC0_RX_EOF_MODE_S  3
/* SLC_SLC0_RX_FILL_MODE : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_FILL_MODE    (BIT(2))
#define SLC_SLC0_RX_FILL_MODE_M  (BIT(2))
#define SLC_SLC0_RX_FILL_MODE_V  0x1
#define SLC_SLC0_RX_FILL_MODE_S  2
/* SLC_SLC0_INFOR_NO_REPLACE : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: .*/
#define SLC_SLC0_INFOR_NO_REPLACE    (BIT(1))
#define SLC_SLC0_INFOR_NO_REPLACE_M  (BIT(1))
#define SLC_SLC0_INFOR_NO_REPLACE_V  0x1
#define SLC_SLC0_INFOR_NO_REPLACE_S  1
/* SLC_SLC0_TOKEN_NO_REPLACE : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TOKEN_NO_REPLACE    (BIT(0))
#define SLC_SLC0_TOKEN_NO_REPLACE_M  (BIT(0))
#define SLC_SLC0_TOKEN_NO_REPLACE_V  0x1
#define SLC_SLC0_TOKEN_NO_REPLACE_S  0

#define SLC_TXLINK_DSCR_REG          (DR_REG_SLC_BASE + 0x9C)
/* SLC_SLC0_TXLINK_DSCR : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: .*/
#define SLC_SLC0_TXLINK_DSCR    0xFFFFFFFF
#define SLC_SLC0_TXLINK_DSCR_M  ((SLC_SLC0_TXLINK_DSCR_V)<<(SLC_SLC0_TXLINK_DSCR_S))
#define SLC_SLC0_TXLINK_DSCR_V  0xFFFFFFFF
#define SLC_SLC0_TXLINK_DSCR_S  0

#define SLC_TXLINK_DSCR_BF0_REG          (DR_REG_SLC_BASE + 0xA0)
/* SLC_SLC0_TXLINK_DSCR_BF0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: .*/
#define SLC_SLC0_TXLINK_DSCR_BF0    0xFFFFFFFF
#define SLC_SLC0_TXLINK_DSCR_BF0_M  ((SLC_SLC0_TXLINK_DSCR_BF0_V)<<(SLC_SLC0_TXLINK_DSCR_BF0_S))
#define SLC_SLC0_TXLINK_DSCR_BF0_V  0xFFFFFFFF
#define SLC_SLC0_TXLINK_DSCR_BF0_S  0

#define SLC_TXLINK_DSCR_BF1_REG          (DR_REG_SLC_BASE + 0xA4)
/* SLC_SLC0_TXLINK_DSCR_BF1 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: .*/
#define SLC_SLC0_TXLINK_DSCR_BF1    0xFFFFFFFF
#define SLC_SLC0_TXLINK_DSCR_BF1_M  ((SLC_SLC0_TXLINK_DSCR_BF1_V)<<(SLC_SLC0_TXLINK_DSCR_BF1_S))
#define SLC_SLC0_TXLINK_DSCR_BF1_V  0xFFFFFFFF
#define SLC_SLC0_TXLINK_DSCR_BF1_S  0

#define SLC_RXLINK_DSCR_REG          (DR_REG_SLC_BASE + 0xA8)
/* SLC_SLC0_RXLINK_DSCR : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: .*/
#define SLC_SLC0_RXLINK_DSCR    0xFFFFFFFF
#define SLC_SLC0_RXLINK_DSCR_M  ((SLC_SLC0_RXLINK_DSCR_V)<<(SLC_SLC0_RXLINK_DSCR_S))
#define SLC_SLC0_RXLINK_DSCR_V  0xFFFFFFFF
#define SLC_SLC0_RXLINK_DSCR_S  0

#define SLC_RXLINK_DSCR_BF0_REG          (DR_REG_SLC_BASE + 0xAC)
/* SLC_SLC0_RXLINK_DSCR_BF0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: .*/
#define SLC_SLC0_RXLINK_DSCR_BF0    0xFFFFFFFF
#define SLC_SLC0_RXLINK_DSCR_BF0_M  ((SLC_SLC0_RXLINK_DSCR_BF0_V)<<(SLC_SLC0_RXLINK_DSCR_BF0_S))
#define SLC_SLC0_RXLINK_DSCR_BF0_V  0xFFFFFFFF
#define SLC_SLC0_RXLINK_DSCR_BF0_S  0

#define SLC_RXLINK_DSCR_BF1_REG          (DR_REG_SLC_BASE + 0xB0)
/* SLC_SLC0_RXLINK_DSCR_BF1 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: .*/
#define SLC_SLC0_RXLINK_DSCR_BF1    0xFFFFFFFF
#define SLC_SLC0_RXLINK_DSCR_BF1_M  ((SLC_SLC0_RXLINK_DSCR_BF1_V)<<(SLC_SLC0_RXLINK_DSCR_BF1_S))
#define SLC_SLC0_RXLINK_DSCR_BF1_V  0xFFFFFFFF
#define SLC_SLC0_RXLINK_DSCR_BF1_S  0

#define SLC_TX_ERREOF_DES_ADDR_REG          (DR_REG_SLC_BASE + 0xCC)
/* SLC_SLC0_TX_ERR_EOF_DES_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define SLC_SLC0_TX_ERR_EOF_DES_ADDR    0xFFFFFFFF
#define SLC_SLC0_TX_ERR_EOF_DES_ADDR_M  ((SLC_SLC0_TX_ERR_EOF_DES_ADDR_V)<<(SLC_SLC0_TX_ERR_EOF_DES_ADDR_S))
#define SLC_SLC0_TX_ERR_EOF_DES_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_TX_ERR_EOF_DES_ADDR_S  0

#define SLC_TOKEN_LAT_REG          (DR_REG_SLC_BASE + 0xD4)
/* SLC_SLC0_TOKEN : RO ;bitpos:[11:0] ;default: 12'b0 ; */
/*description: .*/
#define SLC_SLC0_TOKEN    0x00000FFF
#define SLC_SLC0_TOKEN_M  ((SLC_SLC0_TOKEN_V)<<(SLC_SLC0_TOKEN_S))
#define SLC_SLC0_TOKEN_V  0xFFF
#define SLC_SLC0_TOKEN_S  0

#define SLC_TX_DSCR_CONF_REG          (DR_REG_SLC_BASE + 0xD8)
/* SLC_WR_RETRY_THRESHOLD : R/W ;bitpos:[10:0] ;default: 11'h80 ; */
/*description: .*/
#define SLC_WR_RETRY_THRESHOLD    0x000007FF
#define SLC_WR_RETRY_THRESHOLD_M  ((SLC_WR_RETRY_THRESHOLD_V)<<(SLC_WR_RETRY_THRESHOLD_S))
#define SLC_WR_RETRY_THRESHOLD_V  0x7FF
#define SLC_WR_RETRY_THRESHOLD_S  0

#define SLC_CMD_INFOR0_REG          (DR_REG_SLC_BASE + 0xDC)
/* SLC_CMD_CONTENT0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: .*/
#define SLC_CMD_CONTENT0    0xFFFFFFFF
#define SLC_CMD_CONTENT0_M  ((SLC_CMD_CONTENT0_V)<<(SLC_CMD_CONTENT0_S))
#define SLC_CMD_CONTENT0_V  0xFFFFFFFF
#define SLC_CMD_CONTENT0_S  0

#define SLC_CMD_INFOR1_REG          (DR_REG_SLC_BASE + 0xE0)
/* SLC_CMD_CONTENT1 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: .*/
#define SLC_CMD_CONTENT1    0xFFFFFFFF
#define SLC_CMD_CONTENT1_M  ((SLC_CMD_CONTENT1_V)<<(SLC_CMD_CONTENT1_S))
#define SLC_CMD_CONTENT1_V  0xFFFFFFFF
#define SLC_CMD_CONTENT1_S  0

#define SLC_LEN_CONF_REG          (DR_REG_SLC_BASE + 0xE4)
/* SLC_SLC0_TX_NEW_PKT_IND : RO ;bitpos:[28] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_NEW_PKT_IND    (BIT(28))
#define SLC_SLC0_TX_NEW_PKT_IND_M  (BIT(28))
#define SLC_SLC0_TX_NEW_PKT_IND_V  0x1
#define SLC_SLC0_TX_NEW_PKT_IND_S  28
/* SLC_SLC0_RX_NEW_PKT_IND : RO ;bitpos:[27] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_NEW_PKT_IND    (BIT(27))
#define SLC_SLC0_RX_NEW_PKT_IND_M  (BIT(27))
#define SLC_SLC0_RX_NEW_PKT_IND_V  0x1
#define SLC_SLC0_RX_NEW_PKT_IND_S  27
/* SLC_SLC0_TX_GET_USED_DSCR : WO ;bitpos:[26] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_GET_USED_DSCR    (BIT(26))
#define SLC_SLC0_TX_GET_USED_DSCR_M  (BIT(26))
#define SLC_SLC0_TX_GET_USED_DSCR_V  0x1
#define SLC_SLC0_TX_GET_USED_DSCR_S  26
/* SLC_SLC0_RX_GET_USED_DSCR : WO ;bitpos:[25] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_GET_USED_DSCR    (BIT(25))
#define SLC_SLC0_RX_GET_USED_DSCR_M  (BIT(25))
#define SLC_SLC0_RX_GET_USED_DSCR_V  0x1
#define SLC_SLC0_RX_GET_USED_DSCR_S  25
/* SLC_SLC0_TX_PACKET_LOAD_EN : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_PACKET_LOAD_EN    (BIT(24))
#define SLC_SLC0_TX_PACKET_LOAD_EN_M  (BIT(24))
#define SLC_SLC0_TX_PACKET_LOAD_EN_V  0x1
#define SLC_SLC0_TX_PACKET_LOAD_EN_S  24
/* SLC_SLC0_RX_PACKET_LOAD_EN : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_PACKET_LOAD_EN    (BIT(23))
#define SLC_SLC0_RX_PACKET_LOAD_EN_M  (BIT(23))
#define SLC_SLC0_RX_PACKET_LOAD_EN_V  0x1
#define SLC_SLC0_RX_PACKET_LOAD_EN_S  23
/* SLC_SLC0_LEN_INC_MORE : WO ;bitpos:[22] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_LEN_INC_MORE    (BIT(22))
#define SLC_SLC0_LEN_INC_MORE_M  (BIT(22))
#define SLC_SLC0_LEN_INC_MORE_V  0x1
#define SLC_SLC0_LEN_INC_MORE_S  22
/* SLC_SLC0_LEN_INC : WO ;bitpos:[21] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_LEN_INC    (BIT(21))
#define SLC_SLC0_LEN_INC_M  (BIT(21))
#define SLC_SLC0_LEN_INC_V  0x1
#define SLC_SLC0_LEN_INC_S  21
/* SLC_SLC0_LEN_WR : WO ;bitpos:[20] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_LEN_WR    (BIT(20))
#define SLC_SLC0_LEN_WR_M  (BIT(20))
#define SLC_SLC0_LEN_WR_V  0x1
#define SLC_SLC0_LEN_WR_S  20
/* SLC_SLC0_LEN_WDATA : WO ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: .*/
#define SLC_SLC0_LEN_WDATA    0x000FFFFF
#define SLC_SLC0_LEN_WDATA_M  ((SLC_SLC0_LEN_WDATA_V)<<(SLC_SLC0_LEN_WDATA_S))
#define SLC_SLC0_LEN_WDATA_V  0xFFFFF
#define SLC_SLC0_LEN_WDATA_S  0

#define SLC_LENGTH_REG          (DR_REG_SLC_BASE + 0xE8)
/* SLC_SLC0_LEN : RO ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: .*/
#define SLC_SLC0_LEN    0x000FFFFF
#define SLC_SLC0_LEN_M  ((SLC_SLC0_LEN_V)<<(SLC_SLC0_LEN_S))
#define SLC_SLC0_LEN_V  0xFFFFF
#define SLC_SLC0_LEN_S  0

#define SLC_TXPKT_H_DSCR_REG          (DR_REG_SLC_BASE + 0xEC)
/* SLC_SLC0_TX_PKT_H_DSCR_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define SLC_SLC0_TX_PKT_H_DSCR_ADDR    0xFFFFFFFF
#define SLC_SLC0_TX_PKT_H_DSCR_ADDR_M  ((SLC_SLC0_TX_PKT_H_DSCR_ADDR_V)<<(SLC_SLC0_TX_PKT_H_DSCR_ADDR_S))
#define SLC_SLC0_TX_PKT_H_DSCR_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_TX_PKT_H_DSCR_ADDR_S  0

#define SLC_TXPKT_E_DSCR_REG          (DR_REG_SLC_BASE + 0xF0)
/* SLC_SLC0_TX_PKT_E_DSCR_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define SLC_SLC0_TX_PKT_E_DSCR_ADDR    0xFFFFFFFF
#define SLC_SLC0_TX_PKT_E_DSCR_ADDR_M  ((SLC_SLC0_TX_PKT_E_DSCR_ADDR_V)<<(SLC_SLC0_TX_PKT_E_DSCR_ADDR_S))
#define SLC_SLC0_TX_PKT_E_DSCR_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_TX_PKT_E_DSCR_ADDR_S  0

#define SLC_RXPKT_H_DSCR_REG          (DR_REG_SLC_BASE + 0xF4)
/* SLC_SLC0_RX_PKT_H_DSCR_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define SLC_SLC0_RX_PKT_H_DSCR_ADDR    0xFFFFFFFF
#define SLC_SLC0_RX_PKT_H_DSCR_ADDR_M  ((SLC_SLC0_RX_PKT_H_DSCR_ADDR_V)<<(SLC_SLC0_RX_PKT_H_DSCR_ADDR_S))
#define SLC_SLC0_RX_PKT_H_DSCR_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_RX_PKT_H_DSCR_ADDR_S  0

#define SLC_RXPKT_E_DSCR_REG          (DR_REG_SLC_BASE + 0xF8)
/* SLC_SLC0_RX_PKT_E_DSCR_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define SLC_SLC0_RX_PKT_E_DSCR_ADDR    0xFFFFFFFF
#define SLC_SLC0_RX_PKT_E_DSCR_ADDR_M  ((SLC_SLC0_RX_PKT_E_DSCR_ADDR_V)<<(SLC_SLC0_RX_PKT_E_DSCR_ADDR_S))
#define SLC_SLC0_RX_PKT_E_DSCR_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_RX_PKT_E_DSCR_ADDR_S  0

#define SLC_TXPKTU_H_DSCR_REG          (DR_REG_SLC_BASE + 0xFC)
/* SLC_SLC0_TX_PKT_START_DSCR_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define SLC_SLC0_TX_PKT_START_DSCR_ADDR    0xFFFFFFFF
#define SLC_SLC0_TX_PKT_START_DSCR_ADDR_M  ((SLC_SLC0_TX_PKT_START_DSCR_ADDR_V)<<(SLC_SLC0_TX_PKT_START_DSCR_ADDR_S))
#define SLC_SLC0_TX_PKT_START_DSCR_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_TX_PKT_START_DSCR_ADDR_S  0

#define SLC_TXPKTU_E_DSCR_REG          (DR_REG_SLC_BASE + 0x100)
/* SLC_SLC0_TX_PKT_END_DSCR_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define SLC_SLC0_TX_PKT_END_DSCR_ADDR    0xFFFFFFFF
#define SLC_SLC0_TX_PKT_END_DSCR_ADDR_M  ((SLC_SLC0_TX_PKT_END_DSCR_ADDR_V)<<(SLC_SLC0_TX_PKT_END_DSCR_ADDR_S))
#define SLC_SLC0_TX_PKT_END_DSCR_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_TX_PKT_END_DSCR_ADDR_S  0

