espressif/esp-idf/components/soc/esp32s3/include/soc/slc_reg.h
#define SLC_RXPKTU_H_DSCR_REG          (DR_REG_SLC_BASE + 0x104)
/* SLC_SLC0_RX_PKT_START_DSCR_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define SLC_SLC0_RX_PKT_START_DSCR_ADDR    0xFFFFFFFF
#define SLC_SLC0_RX_PKT_START_DSCR_ADDR_M  ((SLC_SLC0_RX_PKT_START_DSCR_ADDR_V)<<(SLC_SLC0_RX_PKT_START_DSCR_ADDR_S))
#define SLC_SLC0_RX_PKT_START_DSCR_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_RX_PKT_START_DSCR_ADDR_S  0

#define SLC_RXPKTU_E_DSCR_REG          (DR_REG_SLC_BASE + 0x108)
/* SLC_SLC0_RX_PKT_END_DSCR_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define SLC_SLC0_RX_PKT_END_DSCR_ADDR    0xFFFFFFFF
#define SLC_SLC0_RX_PKT_END_DSCR_ADDR_M  ((SLC_SLC0_RX_PKT_END_DSCR_ADDR_V)<<(SLC_SLC0_RX_PKT_END_DSCR_ADDR_S))
#define SLC_SLC0_RX_PKT_END_DSCR_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_RX_PKT_END_DSCR_ADDR_S  0

#define SLC_SEQ_POSITION_REG          (DR_REG_SLC_BASE + 0x114)
/* SLC_SLC0_SEQ_POSITION : R/W ;bitpos:[7:0] ;default: 8'h9 ; */
/*description: .*/
#define SLC_SLC0_SEQ_POSITION    0x000000FF
#define SLC_SLC0_SEQ_POSITION_M  ((SLC_SLC0_SEQ_POSITION_V)<<(SLC_SLC0_SEQ_POSITION_S))
#define SLC_SLC0_SEQ_POSITION_V  0xFF
#define SLC_SLC0_SEQ_POSITION_S  0

#define SLC_DSCR_REC_CONF_REG          (DR_REG_SLC_BASE + 0x118)
/* SLC_SLC0_RX_DSCR_REC_LIM : R/W ;bitpos:[9:0] ;default: 10'h3ff ; */
/*description: .*/
#define SLC_SLC0_RX_DSCR_REC_LIM    0x000003FF
#define SLC_SLC0_RX_DSCR_REC_LIM_M  ((SLC_SLC0_RX_DSCR_REC_LIM_V)<<(SLC_SLC0_RX_DSCR_REC_LIM_S))
#define SLC_SLC0_RX_DSCR_REC_LIM_V  0x3FF
#define SLC_SLC0_RX_DSCR_REC_LIM_S  0

#define SLC_SDIO_CRC_ST0_REG          (DR_REG_SLC_BASE + 0x11C)
/* SLC_DAT3_CRC_ERR_CNT : RO ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: .*/
#define SLC_DAT3_CRC_ERR_CNT    0x000000FF
#define SLC_DAT3_CRC_ERR_CNT_M  ((SLC_DAT3_CRC_ERR_CNT_V)<<(SLC_DAT3_CRC_ERR_CNT_S))
#define SLC_DAT3_CRC_ERR_CNT_V  0xFF
#define SLC_DAT3_CRC_ERR_CNT_S  24
/* SLC_DAT2_CRC_ERR_CNT : RO ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: .*/
#define SLC_DAT2_CRC_ERR_CNT    0x000000FF
#define SLC_DAT2_CRC_ERR_CNT_M  ((SLC_DAT2_CRC_ERR_CNT_V)<<(SLC_DAT2_CRC_ERR_CNT_S))
#define SLC_DAT2_CRC_ERR_CNT_V  0xFF
#define SLC_DAT2_CRC_ERR_CNT_S  16
/* SLC_DAT1_CRC_ERR_CNT : RO ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: .*/
#define SLC_DAT1_CRC_ERR_CNT    0x000000FF
#define SLC_DAT1_CRC_ERR_CNT_M  ((SLC_DAT1_CRC_ERR_CNT_V)<<(SLC_DAT1_CRC_ERR_CNT_S))
#define SLC_DAT1_CRC_ERR_CNT_V  0xFF
#define SLC_DAT1_CRC_ERR_CNT_S  8
/* SLC_DAT0_CRC_ERR_CNT : RO ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: .*/
#define SLC_DAT0_CRC_ERR_CNT    0x000000FF
#define SLC_DAT0_CRC_ERR_CNT_M  ((SLC_DAT0_CRC_ERR_CNT_V)<<(SLC_DAT0_CRC_ERR_CNT_S))
#define SLC_DAT0_CRC_ERR_CNT_V  0xFF
#define SLC_DAT0_CRC_ERR_CNT_S  0

#define SLC_SDIO_CRC_ST1_REG          (DR_REG_SLC_BASE + 0x120)
/* SLC_ERR_CNT_CLR : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: .*/
#define SLC_ERR_CNT_CLR    (BIT(31))
#define SLC_ERR_CNT_CLR_M  (BIT(31))
#define SLC_ERR_CNT_CLR_V  0x1
#define SLC_ERR_CNT_CLR_S  31
/* SLC_CMD_CRC_ERR_CNT : RO ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: .*/
#define SLC_CMD_CRC_ERR_CNT    0x000000FF
#define SLC_CMD_CRC_ERR_CNT_M  ((SLC_CMD_CRC_ERR_CNT_V)<<(SLC_CMD_CRC_ERR_CNT_S))
#define SLC_CMD_CRC_ERR_CNT_V  0xFF
#define SLC_CMD_CRC_ERR_CNT_S  0

#define SLC_EOF_START_DES_REG          (DR_REG_SLC_BASE + 0x124)
/* SLC_SLC0_EOF_START_DES_ADDR : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: .*/
#define SLC_SLC0_EOF_START_DES_ADDR    0xFFFFFFFF
#define SLC_SLC0_EOF_START_DES_ADDR_M  ((SLC_SLC0_EOF_START_DES_ADDR_V)<<(SLC_SLC0_EOF_START_DES_ADDR_S))
#define SLC_SLC0_EOF_START_DES_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_EOF_START_DES_ADDR_S  0

#define SLC_PUSH_DSCR_ADDR_REG          (DR_REG_SLC_BASE + 0x128)
/* SLC_SLC0_RX_PUSH_DSCR_ADDR : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_PUSH_DSCR_ADDR    0xFFFFFFFF
#define SLC_SLC0_RX_PUSH_DSCR_ADDR_M  ((SLC_SLC0_RX_PUSH_DSCR_ADDR_V)<<(SLC_SLC0_RX_PUSH_DSCR_ADDR_S))
#define SLC_SLC0_RX_PUSH_DSCR_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_RX_PUSH_DSCR_ADDR_S  0

#define SLC_DONE_DSCR_ADDR_REG          (DR_REG_SLC_BASE + 0x12C)
/* SLC_SLC0_RX_DONE_DSCR_ADDR : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_DONE_DSCR_ADDR    0xFFFFFFFF
#define SLC_SLC0_RX_DONE_DSCR_ADDR_M  ((SLC_SLC0_RX_DONE_DSCR_ADDR_V)<<(SLC_SLC0_RX_DONE_DSCR_ADDR_S))
#define SLC_SLC0_RX_DONE_DSCR_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_RX_DONE_DSCR_ADDR_S  0

#define SLC_SUB_START_DES_REG          (DR_REG_SLC_BASE + 0x130)
/* SLC_SLC0_SUB_PAC_START_DSCR_ADDR : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: .*/
#define SLC_SLC0_SUB_PAC_START_DSCR_ADDR    0xFFFFFFFF
#define SLC_SLC0_SUB_PAC_START_DSCR_ADDR_M  ((SLC_SLC0_SUB_PAC_START_DSCR_ADDR_V)<<(SLC_SLC0_SUB_PAC_START_DSCR_ADDR_S))
#define SLC_SLC0_SUB_PAC_START_DSCR_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_SUB_PAC_START_DSCR_ADDR_S  0

#define SLC_DSCR_CNT_REG          (DR_REG_SLC_BASE + 0x134)
/* SLC_SLC0_RX_GET_EOF_OCC : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_GET_EOF_OCC    (BIT(16))
#define SLC_SLC0_RX_GET_EOF_OCC_M  (BIT(16))
#define SLC_SLC0_RX_GET_EOF_OCC_V  0x1
#define SLC_SLC0_RX_GET_EOF_OCC_S  16
/* SLC_SLC0_RX_DSCR_CNT_LAT : RO ;bitpos:[9:0] ;default: 10'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_DSCR_CNT_LAT    0x000003FF
#define SLC_SLC0_RX_DSCR_CNT_LAT_M  ((SLC_SLC0_RX_DSCR_CNT_LAT_V)<<(SLC_SLC0_RX_DSCR_CNT_LAT_S))
#define SLC_SLC0_RX_DSCR_CNT_LAT_V  0x3FF
#define SLC_SLC0_RX_DSCR_CNT_LAT_S  0

#define SLC_LEN_LIM_CONF_REG          (DR_REG_SLC_BASE + 0x138)
/* SLC_SLC0_LEN_LIM : R/W ;bitpos:[19:0] ;default: 20'h5400 ; */
/*description: .*/
#define SLC_SLC0_LEN_LIM    0x000FFFFF
#define SLC_SLC0_LEN_LIM_M  ((SLC_SLC0_LEN_LIM_V)<<(SLC_SLC0_LEN_LIM_S))
#define SLC_SLC0_LEN_LIM_V  0xFFFFF
#define SLC_SLC0_LEN_LIM_S  0

#define SLC_INT_ST1_REG          (DR_REG_SLC_BASE + 0x13C)
/* SLC_SLC0_HOST_POP_EOF_ERR_INT_ST1 : RO ;bitpos:[27] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_ST1    (BIT(27))
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_ST1_M  (BIT(27))
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_ST1_V  0x1
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_ST1_S  27
/* SLC_SLC0_RX_QUICK_EOF_INT_ST1 : RO ;bitpos:[26] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_QUICK_EOF_INT_ST1    (BIT(26))
#define SLC_SLC0_RX_QUICK_EOF_INT_ST1_M  (BIT(26))
#define SLC_SLC0_RX_QUICK_EOF_INT_ST1_V  0x1
#define SLC_SLC0_RX_QUICK_EOF_INT_ST1_S  26
/* SLC_CMD_DTC_INT_ST1 : RO ;bitpos:[25] ;default: 1'b0 ; */
/*description: .*/
#define SLC_CMD_DTC_INT_ST1    (BIT(25))
#define SLC_CMD_DTC_INT_ST1_M  (BIT(25))
#define SLC_CMD_DTC_INT_ST1_V  0x1
#define SLC_CMD_DTC_INT_ST1_S  25
/* SLC_SLC0_TX_ERR_EOF_INT_ST1 : RO ;bitpos:[24] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_ERR_EOF_INT_ST1    (BIT(24))
#define SLC_SLC0_TX_ERR_EOF_INT_ST1_M  (BIT(24))
#define SLC_SLC0_TX_ERR_EOF_INT_ST1_V  0x1
#define SLC_SLC0_TX_ERR_EOF_INT_ST1_S  24
/* SLC_SLC0_WR_RETRY_DONE_INT_ST1 : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_WR_RETRY_DONE_INT_ST1    (BIT(23))
#define SLC_SLC0_WR_RETRY_DONE_INT_ST1_M  (BIT(23))
#define SLC_SLC0_WR_RETRY_DONE_INT_ST1_V  0x1
#define SLC_SLC0_WR_RETRY_DONE_INT_ST1_S  23
/* SLC_SLC0_HOST_RD_ACK_INT_ST1 : RO ;bitpos:[22] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_HOST_RD_ACK_INT_ST1    (BIT(22))
#define SLC_SLC0_HOST_RD_ACK_INT_ST1_M  (BIT(22))
#define SLC_SLC0_HOST_RD_ACK_INT_ST1_V  0x1
#define SLC_SLC0_HOST_RD_ACK_INT_ST1_S  22
/* SLC_SLC0_TX_DSCR_EMPTY_INT_ST1 : RO ;bitpos:[21] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_DSCR_EMPTY_INT_ST1    (BIT(21))
#define SLC_SLC0_TX_DSCR_EMPTY_INT_ST1_M  (BIT(21))
#define SLC_SLC0_TX_DSCR_EMPTY_INT_ST1_V  0x1
#define SLC_SLC0_TX_DSCR_EMPTY_INT_ST1_S  21
/* SLC_SLC0_RX_DSCR_ERR_INT_ST1 : RO ;bitpos:[20] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_DSCR_ERR_INT_ST1    (BIT(20))
#define SLC_SLC0_RX_DSCR_ERR_INT_ST1_M  (BIT(20))
#define SLC_SLC0_RX_DSCR_ERR_INT_ST1_V  0x1
#define SLC_SLC0_RX_DSCR_ERR_INT_ST1_S  20
/* SLC_SLC0_TX_DSCR_ERR_INT_ST1 : RO ;bitpos:[19] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_DSCR_ERR_INT_ST1    (BIT(19))
#define SLC_SLC0_TX_DSCR_ERR_INT_ST1_M  (BIT(19))
#define SLC_SLC0_TX_DSCR_ERR_INT_ST1_V  0x1
#define SLC_SLC0_TX_DSCR_ERR_INT_ST1_S  19
/* SLC_SLC0_TOHOST_INT_ST1 : RO ;bitpos:[18] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TOHOST_INT_ST1    (BIT(18))
#define SLC_SLC0_TOHOST_INT_ST1_M  (BIT(18))
#define SLC_SLC0_TOHOST_INT_ST1_V  0x1
#define SLC_SLC0_TOHOST_INT_ST1_S  18
/* SLC_SLC0_RX_EOF_INT_ST1 : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_EOF_INT_ST1    (BIT(17))
#define SLC_SLC0_RX_EOF_INT_ST1_M  (BIT(17))
#define SLC_SLC0_RX_EOF_INT_ST1_V  0x1
#define SLC_SLC0_RX_EOF_INT_ST1_S  17
/* SLC_SLC0_RX_DONE_INT_ST1 : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_DONE_INT_ST1    (BIT(16))
#define SLC_SLC0_RX_DONE_INT_ST1_M  (BIT(16))
#define SLC_SLC0_RX_DONE_INT_ST1_V  0x1
#define SLC_SLC0_RX_DONE_INT_ST1_S  16
/* SLC_SLC0_TX_SUC_EOF_INT_ST1 : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_SUC_EOF_INT_ST1    (BIT(15))
#define SLC_SLC0_TX_SUC_EOF_INT_ST1_M  (BIT(15))
#define SLC_SLC0_TX_SUC_EOF_INT_ST1_V  0x1
#define SLC_SLC0_TX_SUC_EOF_INT_ST1_S  15
/* SLC_SLC0_TX_DONE_INT_ST1 : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_DONE_INT_ST1    (BIT(14))
#define SLC_SLC0_TX_DONE_INT_ST1_M  (BIT(14))
#define SLC_SLC0_TX_DONE_INT_ST1_V  0x1
#define SLC_SLC0_TX_DONE_INT_ST1_S  14
/* SLC_SLC0_TOKEN1_1TO0_INT_ST1 : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TOKEN1_1TO0_INT_ST1    (BIT(13))
#define SLC_SLC0_TOKEN1_1TO0_INT_ST1_M  (BIT(13))
#define SLC_SLC0_TOKEN1_1TO0_INT_ST1_V  0x1
#define SLC_SLC0_TOKEN1_1TO0_INT_ST1_S  13
/* SLC_SLC0_TOKEN0_1TO0_INT_ST1 : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TOKEN0_1TO0_INT_ST1    (BIT(12))
#define SLC_SLC0_TOKEN0_1TO0_INT_ST1_M  (BIT(12))
#define SLC_SLC0_TOKEN0_1TO0_INT_ST1_V  0x1
#define SLC_SLC0_TOKEN0_1TO0_INT_ST1_S  12
/* SLC_SLC0_TX_OVF_INT_ST1 : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_OVF_INT_ST1    (BIT(11))
#define SLC_SLC0_TX_OVF_INT_ST1_M  (BIT(11))
#define SLC_SLC0_TX_OVF_INT_ST1_V  0x1
#define SLC_SLC0_TX_OVF_INT_ST1_S  11
/* SLC_SLC0_RX_UDF_INT_ST1 : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_UDF_INT_ST1    (BIT(10))
#define SLC_SLC0_RX_UDF_INT_ST1_M  (BIT(10))
#define SLC_SLC0_RX_UDF_INT_ST1_V  0x1
#define SLC_SLC0_RX_UDF_INT_ST1_S  10
/* SLC_SLC0_TX_START_INT_ST1 : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_TX_START_INT_ST1    (BIT(9))
#define SLC_SLC0_TX_START_INT_ST1_M  (BIT(9))
#define SLC_SLC0_TX_START_INT_ST1_V  0x1
#define SLC_SLC0_TX_START_INT_ST1_S  9
/* SLC_SLC0_RX_START_INT_ST1 : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: .*/
#define SLC_SLC0_RX_START_INT_ST1    (BIT(8))
#define SLC_SLC0_RX_START_INT_ST1_M  (BIT(8))
#define SLC_SLC0_RX_START_INT_ST1_V  0x1
#define SLC_SLC0_RX_START_INT_ST1_S  8
/* SLC_FRHOST_BIT7_INT_ST1 : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT7_INT_ST1    (BIT(7))
#define SLC_FRHOST_BIT7_INT_ST1_M  (BIT(7))
#define SLC_FRHOST_BIT7_INT_ST1_V  0x1
#define SLC_FRHOST_BIT7_INT_ST1_S  7
/* SLC_FRHOST_BIT6_INT_ST1 : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT6_INT_ST1    (BIT(6))
#define SLC_FRHOST_BIT6_INT_ST1_M  (BIT(6))
#define SLC_FRHOST_BIT6_INT_ST1_V  0x1
#define SLC_FRHOST_BIT6_INT_ST1_S  6
/* SLC_FRHOST_BIT5_INT_ST1 : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT5_INT_ST1    (BIT(5))
#define SLC_FRHOST_BIT5_INT_ST1_M  (BIT(5))
#define SLC_FRHOST_BIT5_INT_ST1_V  0x1
#define SLC_FRHOST_BIT5_INT_ST1_S  5
/* SLC_FRHOST_BIT4_INT_ST1 : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT4_INT_ST1    (BIT(4))
#define SLC_FRHOST_BIT4_INT_ST1_M  (BIT(4))
#define SLC_FRHOST_BIT4_INT_ST1_V  0x1
#define SLC_FRHOST_BIT4_INT_ST1_S  4
/* SLC_FRHOST_BIT3_INT_ST1 : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT3_INT_ST1    (BIT(3))
#define SLC_FRHOST_BIT3_INT_ST1_M  (BIT(3))
#define SLC_FRHOST_BIT3_INT_ST1_V  0x1
#define SLC_FRHOST_BIT3_INT_ST1_S  3
/* SLC_FRHOST_BIT2_INT_ST1 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT2_INT_ST1    (BIT(2))
#define SLC_FRHOST_BIT2_INT_ST1_M  (BIT(2))
#define SLC_FRHOST_BIT2_INT_ST1_V  0x1
#define SLC_FRHOST_BIT2_INT_ST1_S  2
/* SLC_FRHOST_BIT1_INT_ST1 : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT1_INT_ST1    (BIT(1))
#define SLC_FRHOST_BIT1_INT_ST1_M  (BIT(1))
#define SLC_FRHOST_BIT1_INT_ST1_V  0x1
#define SLC_FRHOST_BIT1_INT_ST1_S  1
/* SLC_FRHOST_BIT0_INT_ST1 : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define SLC_FRHOST_BIT0_INT_ST1    (BIT(0))
#define SLC_FRHOST_BIT0_INT_ST1_M  (BIT(0))
#define SLC_FRHOST_BIT0_INT_ST1_V  0x1
#define SLC_FRHOST_BIT0_INT_ST1_S  0

